programming/cpp/notes/control-statements.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>control statements</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">control statements</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">if</a></li>
<li><a href="#sec-2">if else</a>
<ul>
<li><a href="#sec-2-1">Conditional operator ?</a></li>
</ul>
</li>
<li><a href="#sec-3">while</a></li>
<li><a href="#sec-4">do while</a></li>
<li><a href="#sec-5">for</a>
<ul>
<li><a href="#sec-5-1">foreach?</a></li>
</ul>
</li>
<li><a href="#sec-6">switch</a></li>
<li><a href="#sec-7">break</a></li>
<li><a href="#sec-8">continue</a></li>
<li><a href="#sec-9">goto</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">if</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
if (expression)
  {statement}
</pre>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000; font-weight: bold;">if</span> (x == y)
  {x = x + 5;}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">if else</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
if (expression)
  {if true statement}
else
  {if false statement}
</pre>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000; font-weight: bold;">if</span> (x &gt; 5)
  {x++;}
<span style="color: #000000; font-weight: bold;">else</span>
  {x = x + 5;}
</pre>
</div>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Conditional operator ?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>?:</code> Ternary Condition <code>x = (a &lt; b) ? a : b;</code> right to left
</p>

<pre class="example">
conditionalExpression ? trueExpression1 : falseExpression2
</pre>

<div class="org-src-container">

<pre class="src src-cpp">(x &gt; 5) ? x++ : x = x + 5;

<span style="color: #cd0000;">// </span><span style="color: #cd0000;">Display the shorter of s and t</span>
cout &lt;&lt; (s.length() &lt; t.length() ? s : t);
</pre>
</div>

<p>
Note that the expressions must have the same type.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">while</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
while (expression)
  {statement}
</pre>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000; font-weight: bold;">while</span> (x &lt; 3)
  {x++;}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">do while</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
do
  {statement}
while (expression)
</pre>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000; font-weight: bold;">do</span>
  {x++;}
<span style="color: #000000; font-weight: bold;">while</span> (x &lt; 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">for</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
for (init, comparison, modifier)
  {statement}
</pre>


<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000; font-weight: bold;">for</span> (i = 0; i &lt; 10; i++)
  {someFunct();}
</pre>
</div>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">foreach?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
range-based 'for' loops (not C++98 mode)
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000; font-weight: bold;">for</span> (<span style="color: #000080; font-weight: bold;">int</span> <span style="color: #8b008b;">n</span> : v) {
    <span style="color: #0000cd;">std</span>::cout &lt;&lt; n &lt;&lt; <span style="color: #006400;">'\n'</span>;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">switch</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
switch (int)
  {
    case (expression): statement
    case (expression): statement
    default : (expression)
  }
</pre>


<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000080; font-weight: bold;">int</span> <span style="color: #8b008b;">x</span> = 5;
<span style="color: #000000; font-weight: bold;">switch</span>(x)
{
  <span style="color: #000000; font-weight: bold;">case</span> 1: cout &lt;&lt; <span style="color: #006400;">"test1"</span>;
    <span style="color: #000000; font-weight: bold;">break</span>;
  <span style="color: #000000; font-weight: bold;">case</span> 5: cout &lt;&lt; <span style="color: #006400;">"test5"</span>;
    <span style="color: #000000; font-weight: bold;">break</span>;
  <span style="color: #000000; font-weight: bold;">default</span>: cout &lt;&lt; <span style="color: #006400;">"none"</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">break</h2>
<div class="outline-text-2" id="text-7">
<p>
break quits out of the loop/switch, without completing the remaining
statements in the loop/switch. 
</p>


<p>
usage:
</p>

<p>
most common usage break statement is in some form of infinite loop, such as
while(true){},
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">continue</h2>
<div class="outline-text-2" id="text-8">
<p>
continue on the other hand continues directly to the next iteration of
loop without executing the remaining statements in the loop. 
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">goto</h2>
<div class="outline-text-2" id="text-9">
<p>
don't use
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #000000; font-weight: bold;">goto</span> <span style="color: #0000cd;">endloop</span>;

<span style="color: #0000cd;">endloop</span>:
</pre>
</div>


<p>
<a href="./notes.html">back</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
